Repository: fengyizhou/sound
Catalog: 音效软件.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: fr

# GuideBook..Guide0..StepMake your own sound pad..TaskGroup2..TaskownButton..title
source: Add a SwiftUI Button
fr: Ajouter un bouton SwiftUI

source: Time to step it up a notch. You’ll dive deeper into the code to create custom buttons for your sound pad.
fr: Il est temps de monter d’un cran. Tu vas pouvoir plonger davantage dans le code pour créer des boutons personnalisés pour ton contrôleur de sons.

source: In preview on the left, you can see a [Button](doc://com.apple.documentation/documentation/swiftui/button) in the middle of the screen.
fr: Dans l’aperçu de gauche, tu peux voir un [Bouton](doc://com.apple.documentation/documentation/swiftui/button) au milieu de l’écran.

source: Tap or click the button in the preview; did you hear anything?
fr: Touche le bouton dans l’aperçu ou clique dessus. Tu as entendu quelque chose ?

source: When you tap or click a `Button`, the code calls the `soundPlayer.playSound(.FirstGearFX)` [function](glossary://function).
fr: Quand tu touches un `Button` (bouton) ou cliques dessus, le code appelle la [fonction](glossary://function) `soundPlayer.playSound(.FirstGearFX)`

source: A function [call](glossary://call) asks the function to run. In this case, the function calls (or plays) the `.FirstGearFX` sound. Try changing the sound to something else.
fr: Une fonction [appeler](glossary://call) demande à la fonction de s’exécuter. Dans ce cas, la fonction appelle (ou joue) le son `.FirstGearFX`. Essaie de remplacer le son par autre chose.

source: Hmm…the button doesn’t look like a sound pad button. You should try changing the look of the button.
fr: Hum… le bouton ne ressemble pas à un bouton de contrôleur de sons. Tu devrais essayer de changer son aspect.

source: Remove the old button and replace it with the code below:
fr: Supprime l’ancien bouton et remplace-le par le code ci-dessous :

source: Button { soundPlayer.playSound(.FirstGearFX) } label: { Circle() //#-learning-code-snippet(6.buttonLabel) }
fr: Bouton { soundPlayer.playSound(.FirstGearFX) } label: { Circle() //#-learning-code-snippet(6.buttonLabel) }

source: You can add a custom `label` to the button to change how it looks. Placing `Circle()` inside `label` turns the button into a circle.
fr: Tu peux ajouter une valeur `label` (étiquette) au bouton pour changer son aspect. Si tu places `Circle()` dans `label`, cela transforme le bouton en cercle.

source: Replace `Circle()` with the `ButtonView` below:
fr: Remplace `Circle()` par la vue `ButtonView` ci-dessous :

source: `ButtonView` takes in a single [parameter](glossary://parameter) `color`. You can change the color of your button by replacing `.orange` with your favorite color.
fr: `ButtonView` prend un [paramètre](glossary://parameter) `color` unique. Tu peux modifier la couleur de ton bouton en remplaçant `.orange` par ta couleur préférée.

source: Wahoo! Now you can create your own button to play any sound!
fr: Ouah ! Tu peux maintenant créer ton propre bouton pour jouer n’importe quel son !
