Repository: fengyizhou/sound
Catalog: 音效软件.swiftpm/Guide/Resources/*.lproj/Localizable.strings
Languages: fr

# GuideBook..title
source: Sound Pad
fr: Contrôleur de sons

# GuideBook..WelcomeMessageCreate your own music with a sound pad..title
source: Create your own music with a sound pad
fr: Créer de la musique avec un contrôleur de sons

# GuideBook..WelcomeMessageCreate your own music with a sound pad..Paragraph0
source: In this tutorial, you’ll explore the different sound functions and their capabilities by customizing your very own sound pad.
fr: Pendant ce tutoriel, tu exploreras les différentes fonctions sonores et leurs fonctionnalités en personnalisant ton propre contrôleur de sons.

# GuideBook..WelcomeMessageCreate your own music with a sound pad..Paragraph1
source: Get ready to have fun and dance to your own soundtrack!
fr: Prépare-toi à t’amuser et à danser sur ta propre musique !

# GuideBook..Guide0..StepMake your own sound pad..title
source: Make your own sound pad
fr: Créer un contrôleur de sons personnalisé

source: The sound pad app allows you to mix and match different audio components to create your own music. You can make your own musical instrument with code and record musical compositions to share with friends and family.
fr: Lʼapp de contrôleur de sons te permet d’assembler plusieurs composants audio pour créer ta propre musique. Tu peux créer ton propre instrument de musique avec du code et enregistrer tes compositions musicales pour les partager avec tes amis et ta famille !

source: Ready to create your own jam?
fr: Tu es prêt à créer ta propre compo ?

# GuideBook..Guide0..StepMake your own sound pad..TaskGroup0..title
source: Designing your sound pad
fr: Concevoir un contrôleur de sons

source: Play different beats
fr: Jouer des rythmes différents

source: You’ve just been tasked with a critical mission: your friends are having a party and they’ve asked you to spin some funky beats.
fr: On vient de te confier une mission très importante : tes amis sont à une fête et tu dois y passer des morceaux entraînants.

source: But hey, you’re not sweating it! You have a secret strategy: you can use the power of code to make jams like the world has never heard before 🧑‍🎤.
fr: Mais hé, pas de souci pour toi ! Tu as une stratégie secrète : tu peux faire appel à la puissance du code pour mixer comme personne 🧑‍🎤.

source: Before you get started, look at preview on the right and play around with the sound pad app.
fr: Avant de te lancer, observe l’aperçu de droite et explore l’app Contrôleur de sons.

source: Some questions to consider while using the app:
fr: Voici quelques questions à prendre en compte pendant l’utilisation de lʼapp :

source: What happens when you tap or click on one of the sound pad buttons?
fr: Que se passe-t-il lorsque tu touches un des boutons du contrôleur de sons ou cliques dessus ?

source: How do you stop a sound?
fr: Comment arrêter un son ?

source: What happens when you tap or click on the red Record button?
fr: Que se passe-t-il lorsque tu touches le bouton Enregistrer rouge ou cliques dessus ?

source: Use these guiding questions to figure out how the sound pad works.
fr: Aide-toi de ces questions pour comprendre le fonctionnement de Contrôleur de sons.

source: Notice that the two buttons in the preview each correspond to a `LoopButton` in `SoundPadView`.
fr: Tu peux voir que les deux boutons de l’aperçu correspondent chacun à un bouton `LoopButton` dans `SoundPadView`.

source: Tapping or clicking a `LoopButton` plays a beat. Add the code snippet below to add a new `LoopButton`:
fr: Quand tu touches ou cliques sur un bouton `LoopButton`, cela lance un rythme. Ajoute l’extrait de code ci-dessous pour ajouter un nouveau bouton `LoopButton` :

source: To see other beats, select `BeatSounds` and type in a period (`.`). Select a new beat from the list of sounds such as `.GlowBeat`:
fr: Pour écouter d’autres rythmes, sélectionne `BeatSounds` et saisis un point (`.`). Sélectionne un nouveau rythme dans la liste des sons, comme `.GlowBeat`:

source: Try exploring other beats in the sound library and select the beats that you vibe with.
fr: Essaie d’explorer de nouveaux rythmes dans la bibliothèque des sons et sélectionne les rythmes qui te plaisent.

source: Nice! Changing the value of the sound [parameter](glossary://parameter) changes the beat played. Notice that each `LoopButton` also has a `color` parameter.
fr: Excellent ! Si tu modifies la valeur de [paramètre](glossary://parameter) du son, ça modifie aussi le rythme joué. Tu peux remarquer que chaque bouton `LoopButton` possède également un paramètre `color`.

source: You can change the color by deleting `.teal`, typing `.` then choosing from one of the new options, such as `.mint`:
fr: Tu peux modifier la couleur en supprimant `.teal` et en saisissant `.`, puis en choisissant une des nouvelles options, comme `.mint` :

source: You can also try adding these ready-made buttons here! Copy and paste these sample buttons and place them in the highlighted section. Take some time to find all of your favorite beat loops; you’ll use these to compose your music, so think about which sounds you like best:
fr: Tu peux aussi essayer d’ajouter ces boutons prêts à l’emploi ici ! Copie et colle ces exemples de boutons et place-les dans la section mise en évidence. Prends un moment pour trouver toutes tes boucles rythmiques préférées. Tu les utiliseras pour composer ta musique, donc réfléchis aux sons que tu préfères :

source: It’s time to jump into the recording studio!
fr: Il est temps de passer au studio d’enregistrement !

source: Start by playing a beat loop and practice clapping or tapping on the table to your new beat. Can you match the beat of the loop?
fr: Commence par jouer une boucle rythmique et entraîne-toi à frapper des mains ou à taper sur la table en rythme avec ton nouveau rythme. Peux-tu être en cadence avec le rythme de la boucle ?

source: Press the Record button to perform a quick sound check, then play it back and see how it sounds. You’re producing music already! 😎
fr: Appuie sur le bouton Enregistrer pour vérifier rapidement le son, puis lance sa lecture et constate sa qualité. Te voilà déjà en train de produire de la musique ! 😎

# GuideBook..Guide0..StepMake your own sound pad..TaskGroup0..TaskplayBass..title
source: Adding some bass
fr: Ajouter de la basse

source: Now that you’ve got a set of beats on your sound pad, it’s time to try layering some different sounds.
fr: Maintenant que tu as défini un ensemble de rythmes sur ton contrôleur de sons, il est temps d’essayer de superposer plusieurs sons.

source: There are four types of sounds parameters that you can set in `LoopButton` - `beats`, `bass`, `melodic`, and `ambient`:
fr: Il existe quatre types de paramètres de sons que tu peux définir dans `LoopButton` - `beats`, `bass`, `melodic` et `ambient` :

source: Beats set the rhythm of your song.
fr: Les rythmes définissent la cadence de ton morceau.

source: Melody is what makes the song stand out and be memorable. Its the part of the song that people hum to.
fr: C’est la mélodie qui rend le morceau mémorable et unique. C’est la partie du morceau que les gens vont chantonner.

source: Bass is what ties the rhythm and melody of your song together.
fr: La basse lie le rythme et la mélodie de ton morceau.

source: Ambient sounds add depth to your song by setting the mood or atmosphere.
fr: Les sons d’ambiance ajoutent de la profondeur à ton morceau en créant une ambiance ou une atmosphère.

source: Start by pairing your beats with some bass by adding a new `LoopButton` that plays a bass loop:
fr: Commence par associer tes rythmes avec des lignes de basse en ajoutant un nouveau bouton `LoopButton`, qui joue une boucle de basse :

source: Bass { LoopButton(bass: .CosmicBass, color: .gray) LoopButton(bass: .PrismaticaBass7 , color: .brown) }
fr: Basse { LoopButton(bass: .CosmicBass, color: .gray) LoopButton(bass: .PrismaticaBass7 , color: .brown) }

source: Notice in the preview on the right that adding `Bass { }` creates a new Bass section for the loop’s buttons. There are now two sections: Beats and Bass, which help you organize your sounds in different categories, and also by color!
fr: Tu peux voir dans l’aperçu de droite que si tu ajoutes `Bass { }`, cela crée une nouvelle section Basses pour les boutons de la boucle. Il existe maintenant deux sections : Rythmes et Basses, qui te permettent d’organiser tes sons dans différentes catégories, et aussi par couleur !

source: Try playing one loop each from the Beats and Bass sections at the same time to see how they sound together. Pretty good right?
fr: Essaie de jouer une boucle de la section Rythmes et une autre de la section Basses en même temps pour voir comment elles vont ensemble. C’est pas mal non ?

source: Now try playing two loops from the same category at the same time.
fr: Essaie maintenant de jouer deux boucles de la même catégorie en même temps.

source: Ew! 🙉 Notice how bad that sounds? That’s because loops in the same category tend to compete with each other, and this can make your music a bit chaotic.
fr: Berk ! 🙉 Tu entends ce son horrible ? C’est parce que les boucles issues de la même catégorie ont tendance à être conflictuelles, ce qui peut rendre ta musique un peu chaotique.

source: Tip: Try to use only one loop from each category at a time!
fr: Astuce : essaie d’utiliser une seule boucle de chaque catégorie à la fois !

source: Now modify your `LoopButton` so it plays a different bass loop, such as `.DreamsBass1`, and change the color of the button.
fr: Essaie maintenant de modifier ton bouton `LoopButton` pour qu’il joue une boucle de basse différente, comme `.DreamsBass1`, et modifie la couleur du bouton.

source: Take a moment to find and add your favorite bass loops.
fr: Prends un moment pour rechercher et ajouter tes boucles de basse préférées.

source: Place all of the bass sounds inside the `Bass` section. Categorizing them this way helps you find the right sounds to play during your performance: 🎼
fr: Place l’ensemble des sons de basse dans la section `Bass`. En les catégorisant ainsi, tu peux trouver plus facilement les meilleurs sons à jouer pendant ta performance : 🎼

source: Time to head back to the studio!
fr: Il est temps de retourner au studio !

source: Select a beat loop and let it play through one time. When the beat finishes playing through once, add a bass loop to by tapping or clicking one of the Bass buttons. How does that change the vibe?
fr: Sélectionne une boucle rythmique et lance sa lecture jusqu’au bout. Une fois que la lecture du rythme est terminée, ajoute une boucle de basse en touchant un des boutons de basse ou en cliquant dessus. Dans quelle mesure est-ce que cela impacte le ressenti ?

source: When you are satisfied with how the beat and bass sound together, let it play and tap or click Record. Good luck!
fr: Une fois que tu as trouvé une combinaison de rythme et de basse qui te convient, joue-la et touche ou clique sur Enregistrer. Bonne chance !

source: Layering melody and ambient sounds
fr: Superposer la mélodie et les sons d’ambiance

source: What about melody and ambient sounds? Melody is the component that makes your song memorable, so this is really important in making your song.
fr: Qu’en est-il de la mélodie et des sons d’ambiance ? La mélodie est la composante qui rend ton morceau mémorable, c’est pourquoi elle est si importante dans la construction de ton morceau.

source: Ambient sounds help you set the mood for your song, and can help you transition from one part of the song to the next.
fr: Les sons d’ambiance te permettent de définir l’atmosphère de ton morceau et peuvent t’aider à faire la transition entre deux parties du morceau.

source: Can you guess how you add these sections to your sound pad?
fr: Peux-tu dire comment ajouter ces sections à ton contrôleur de sons ?

source: Add the Melodic and Ambient sections with the code below:
fr: Ajoute les sections Mélodique et Ambiance avec le code ci-dessous :

source: Melodic { LoopButton(melodic: .DreamsChords3, color: .teal) } Ambient { LoopButton(ambient: .DiscoSynth1, color: .red) }
fr: Mélodique { LoopButton(melodic: .DreamsChords3, color: .teal) } Ambiant { LoopButton(ambient: .DiscoSynth1, color: .red) }

source: Take a second to experiment with some different melodies and ambient loops by changing `.DreamsChords3` and `.DiscoSynth1`.
fr: Prends une seconde pour tester différentes boucles de mélodies et de sons d’ambiance en modifiant `.DreamsChords3` et `.DiscoSynth1`.

source: How do the melody and ambient sounds affect the music you’re composing?
fr: Quel impact ont la mélodie et les sons d’ambiance sur la musique que tu composes ?

source: Find your favorite melodic loops and add your code inside the Melodic section:
fr: Trouve tes boucles de mélodie préférées et ajoute ton code dans la section Mélodique :

source: Now, add a set of ambient loops to the Ambient section:
fr: Maintenant, ajoute un ensemble de boucles de sons d’ambiance à la section Ambiance :

source: Woo-hoo! Your sound pad is really coming together now. Time to jump into the studio and record first demo tape!
fr: Youhou ! Ton contrôleur de sons commence vraiment à ressembler à quelque chose. Il est temps de passer au studio pour enregistrer ta première démo !

source: Here’s one way to structure your demo:
fr: Voici un moyen de structurer ta démo :

source: Start with a beat and let it play for one full loop.
fr: Commence par un rythme et laisse-le jouer pendant la durée d’une boucle.

source: Add a bass loop and let it play for one full loop.
fr: Ajoute une boucle de basse et laisse-la jouer pendant la durée d’une boucle.

source: Choose a melodic loop and let that play for one full loop.
fr: Choisis une boucle mélodique et laisse-la jouer pendant la durée d’une boucle.

source: Finally, add an ambient sound to set the mood and let your song continue to play.
fr: Enfin, ajoute un son d’ambiance pour définir une atmosphère et continue la lecture de ton morceau.

source: Head over to the next page for more ways to stucture your demo!
fr: Rends-toi à la page suivante pour apprendre d’autres moyens de structurer ton morceau !

source: Now, try experimenting with your performance.
fr: Maintenant, essaie d’expérimenter avec ta performance.

source: One way to vary how your song sounds is to switch up the order of when you introduce different loops. Start your song with the melody first, then introduce the beat, then the ambient sound, then the bass. Which version do you like better?
fr: Tu peux donner une autre dynamique à ton morceau en changeant l’ordre dans lequel tu introduis les différentes boucles. Commence ton morceau par la mélodie, puis lance le rythme, puis le son d’ambiance et enfin la basse. Quelle est ta version préférée ?

source: Record your first demo and send it to your friends to get some feedback!
fr: Enregistre ta première démo et envoie-la à tes amis pour savoir ce qu’ils en pensent !

source: Adding sound effects
fr: Ajouter des effets sonores

source: It’s time to spice things up and add some sound effects!
fr: Il est temps de corser les choses et d’ajouter des effets sonores !

source: First, add a new section, SoundFX, that plays sound effects:
fr: Tout d’abord, ajoute une nouvelle section, SoundFX, qui permet de jouer des effets sonores :

source: Unlike tapping or clicking `LoopButton`, the `SoundFXButton` buttons only play the sound once and then stops. Go ahead, try it out.
fr: À l’inverse de quand tu touches `LoopButton` ou cliques dessus, les boutons `SoundFXButton` jouent le son une seule fois puis s'arrêtent. Vas-y, essaie.

source: Just like `LoopButton`, you can customize the sound and color of `SoundFXButton` by changing the values for the `sound` and `color` [parameters](glossary://parameter).
fr: Comme avec `LoopButton`, tu peux personnaliser le son et la couleur de `SoundFXButton` en modifiant les valeurs des [paramètres](glossary://parameter) `sound` et `color`.

source: Add some oomph to your song with some sound effects. Build out the SoundFX section with the effects you like best:
fr: Ajoute du mordant à ton morceau avec des effets sonores. Alimente la section SoundFX avec les effets que tu préfères :

source: You know the drill…it’s studio session time! 🎉
fr: Tu connais la chanson… C’est l’heure de la session studio ! 🎉

source: You can use sound effects in many places. You could play it at the beginning of the song to create an element of surprise, or you can add it in the middle leading up to the chorus to add some emotion to your song. Try exploring different sound effects and listen to how they affect your song.
fr: Tu peux utiliser des effets sonores à de nombreux endroits. Tu peux en placer un au début du morceau pour créer un élément de surprise, ou l’ajouter au milieu, juste avant le refrain, pour ajouter de l’émotion. Teste différents effets sonores et écoute l’effet qu’ils ont sur ton morceau.

source: Ready? Record a second demo tape that includes different sound effects and compare it with the previous one. Which one do you vibe with most?
fr: Sommes-nous prêts ? Enregistre une deuxième démo qui contient différents effets sonores et compare-la avec la première. Laquelle préfères-tu ?

# GuideBook..Guide0..StepMake your own sound pad..TaskGroup1..title
source: Modifying sounds
fr: Modifier des sons

source: Modify volume
fr: Régler le volume

source: Sometimes you want to change the volume of each sound. You can do this with a [modifier](glossary://modifier).
fr: Il peut arriver que tu veuilles modifier le volume de chaque son. Tu peux le faire à l’aide d’un [modificateur](glossary://modifier).

source: You can change the volume by adding a volume [modifier](glossary://modifier) to any `LoopButton` or `SoundFXButton`.
fr: Tu peux changer le volume en ajoutant un [modificateur](glossary://modifier) de volume à n’importe quel bouton `LoopButton` ou `SoundFXButton`.

source: The volume modifier takes a number between `0` and `1.0`, where `0` is silent and `1.0` is full volume.
fr: Le modificateur de volume prend un chiffre entre `0` et `1.0`, `0` étant silencieux et `1.0` le volume maximal.

source: Try adding this modifier to any of the existing buttons and play it:
fr: Essaie d’ajouter ce modificateur à l’un des boutons existants et lance-le :

source: Do you hear the difference? Setting volume to `0.5` lowers the volume by half.
fr: Entends-tu une différence ? Si tu règles le volume sur `0.5`, cela réduit le volume de moitié.

source: Awesome! Now you can adjust the volume of any sound in your sound pad!
fr: Excellent ! Tu peux maintenant régler le volume de n’importe quel son de ton contrôleur de sons !

source: Modify pitch
fr: Modifier la tonalité

source: There are other [modifiers](glossary://modifier) that you can add to change your sounds, such as adjusting the `pitch`.
fr: Il existe d’autres [modificateurs](glossary://modifier) que tu peux ajouter pour modifier tes sons, par exemple en réglant le `pitch` (la tonalité).

source: You can change the [pitch](glossary://pitch%20audio) by adding a pitch [modifier](glossary://modifier) to any `SoundFXButton` or `LoopButton`:
fr: Tu peux modifier la [tonalité](glossary://pitch%20audio) en ajoutant un [modificateur](glossary://modifier) de tonalité à n’importe quel bouton `SoundFXButton` ou `LoopButton` :

source: Do you hear the difference?
fr: Entends-tu la différence ?

source: Now you can customize the pitch of any sound! Try modifying pitch of the sounds that you have already added.
fr: Tu peux maintenant personnaliser la tonalité de n’importe quel son ! Essaie de modifier la tonalité des sons que tu as déjà ajoutés.

source: A single button can have multiple modifiers for adjusting the pitch and volume all at the same time.
fr: Un seul bouton peut avoir plusieurs modificateurs pour régler la tonalité et le volume simultanément.

source: Modify speed
fr: Modifier la vélocité

source: You can also use [modifiers](glossary://modifier) to adjust the `speed` of each sound.
fr: Tu peux aussi utiliser des [modificateurs](glossary://modifier) pour régler la `speed` (vélocité) de chaque son.

source: To change the speed, you can add a `.speed` modifier. In this project, the speed ranges from `0` to `2.0`, with `2.0` doubling the speed.
fr: Pour changer la vélocité, tu peux ajouter un modificateur `.speed`. Dans ce projet, la vélocité est comprise entre `0` et `2.0`, `2.0` permettant de doubler la vélocité.

source: Add the speed modifier below one of the sound effects or loops to speed it up:
fr: Ajoute le modificateur de vélocité sous l’un des effets sonores ou l’une des boucles pour les accélérer :

source: Can you try adding a speed modifier to another sound to slow it down?
fr: Peux-tu essayer d’ajouter un modificateur de vélocité à un autre son pour le ralentir ?

source: Studio session time!
fr: On passe au studio !

source: Up for a little challenge? Select a beat sound and change the speed to `0.5`. Now try playing your song at this new speed.
fr: D’attaque pour un petit défi ? Sélectionne un son rythmique et fais passer la vélocité à `0.5`. Essaie maintenant de jouer ton morceau avec cette nouvelle vélocité.

source: Try changing another loop, such as a bass or melodic loop to `2.0` speed.
fr: Essaie de changer la vélocité d’une autre boucle, comme une basse ou une mélodie, en `2.0`.

source: What are you waiting for?! Tap or click the Record button and try playing the sounds together. What do you notice about how the song changes when you speed up or slow down loops?
fr: Qu’est-ce que tu attends ?! Touche le bouton Enregistrer ou clique dessus et essaie de jouer les sons ensemble. Que remarques-tu vis-à-vis du morceau quand tu accélères ou ralentis des boucles ?

source: Add a filter
fr: Ajouter un filtre

source: For that extra Wow factor, you can apply filters to your sounds!
fr: Pour ajouter du mordant, tu peux appliquer des filtres à tes sons !

source: Try adding a new sound with a `filter` [modifier](glossary://modifier) and set the value to `drumsBitBrush`.
fr: Essaie d’ajouter un nouveau son avec un [modificateur](glossary://modifier) `filter` et règle la valeur sur `drumsBitBrush`.

source: If you aren’t sure how to add a filter, here is an example:
fr: Si tu ne sais pas comment ajouter un filtre, voici un exemple :

source: Whoa! Did you hear that? That sounds fun-ky!
fr: Ouah ! Tu as entendu ? Ça sonne très funky !

source: Try these other sound effects to see how they change your sounds:
fr: Essaie ces autres effets sonores pour voir en quoi ils changent tes sons :

source: Yippee! You’re almost finished.
fr: Youpi ! Tu as presque terminé.

source: Now it’s time to put everything together. Add different sounds and fine-tune them with volume, pitch, speed, and filter. You can also use these filters to create a funky remix for your song (your new spooky jam?).
fr: Il est maintenant temps de réunir tout ce que nous avons vu. Ajoute différents sons et règle-les à l’aide du volume, de la tonalité, de la vélocité et des filtres. Tu peux aussi utiliser ces filtres pour créer un remix funky de ton morceau (ton nouveau bœuf ?).

source: Record yourself playing the song by tapping or clicking the Record button. When you finish, tap or click the button again to stop recording. Now you have a demo of your song that you can share with your friends and family and see what they think.
fr: Enregistre-toi en train de jouer le morceau en touchant le bouton Enregistrer ou en cliquant dessus. Une fois que tu as terminé, touche de nouveau le bouton ou clique dessus pour mettre fin à l’enregistrement. Tu possèdes maintenant une démo de ton morceau que tu peux partager avec tes amis et ta famille et voir ce qu’ils en pensent.

# GuideBook..Guide0..StepMake your own sound pad..TaskGroup2..title
source: Making your own buttons
fr: Créer un bouton personnalisé
